pulmanturbd/certification2/CabinListRQ.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cab="http://services.rccl.com/Interfaces/CabinList" xmlns:alp="http://www.opentravel.org/OTA/2003/05/alpha">
   <soapenv:Header/>
   <soapenv:Body>
      <cab:getCabinList>
        <OTA_CruiseCabinAvailRQ MaxResponses="50" MoreDataEchoToken="01" Target="Test" RetransmissionIndicator="false" SequenceNmbr="1" TimeStamp="2008-11-25T10:08:12.204-05:00" TransactionIdentifier="106597" Version="1.0" xmlns="http://www.opentravel.org/OTA/2003/05/alpha">
            <POS>
                <Source TerminalID="12502LDJW6" ISOCurrency="USD">
                    <RequestorID ID="313917" ID_Context="AGENCY1" Type="5"/>
                    <BookingChannel Type="7">
                        <CompanyName CompanyShortName="PULLMANTUR"/>
                    </BookingChannel>
                </Source>
                <Source TerminalID="12502LDJW6" ISOCurrency="USD">
                    <RequestorID ID="313917" ID_Context="AGENCY2" Type="5"/>
                    <BookingChannel Type="7">
                        <CompanyName CompanyShortName="PULLMANTUR"/>
                    </BookingChannel>
                </Source>
                <Source TerminalID="12502LDJW6" ISOCurrency="USD">
                    <RequestorID ID="313917" ID_Context="AGENT1" Type="5"/>
                    <BookingChannel Type="7">
                        <CompanyName CompanyShortName="PULLMANTUR"/>
                    </BookingChannel>
                </Source>
            </POS>
            <Guest Age="30">
                <GuestTransportation Mode="29" Status="36">
                    <GatewayCity CodeContext="IATA" LocationCode="BCN"/>
                </GuestTransportation>
            </Guest>
            <GuestCounts>
                <GuestCount Age="30" Quantity="1"/>
            </GuestCounts>
            <SailingInfo>
                <SelectedSailing Start="2020-08-08">
                    <CruiseLine ShipCode="MO" VendorCode="PUL"/>
                    <!--Optional:-->
                    <Region RegionCode="PBLCS" SubRegionCode="PBC"/>
                    <!--Optional:-->
                    <DeparturePort LocationCode="RLG"/>
                    <!--Optional:-->
                    <ArrivalPort LocationCode="HEL"/>
                </SelectedSailing>
                <InclusivePackageOption CruisePackageCode="MOPB0751"/>
                <Currency CurrencyCode="USD" DecimalPlaces="2"/>
                <SelectedCategory BerthedCategoryCode="ST" PricedCategoryCode="ST" WaitlistIndicator="false">
                </SelectedCategory>
            </SailingInfo>
            <SearchQualifiers BerthedCategoryCode="ST" FareCode="C4443339" GroupCode="24" CategoryLocation="Deluxe">
                <Status Status="36"/>
            </SearchQualifiers>
            <SelectedFare GroupCode="24"/>
        </OTA_CruiseCabinAvailRQ>
    </cab:getCabinList>
   </soapenv:Body>
</soapenv:Envelope>